{
  "url": "https://kccncna2022.sched.com/?searchstring=CRI-O\u0026iframe=no",
  "name": "KubeCon + CloudNative North America 2022: Schedule",
  "sessions": [
    {
      "name": "CRI-O’s Senior Year - Peter Hunt, Urvashi Mohnani, Mrunal Patel, Red Hat",
      "url": "https://kccncna2022.sched.com/event/182Ok/cri-os-senior-year-peter-hunt-urvashi-mohnani-mrunal-patel-red-hat?iframe=no",
      "description": "As CRI-O approaches CNCF graduation, it continues in its mission to provide a stable and secure OCI implementation of the Kubernetes CRI. Join the CRI-O team as they give an overview of CRI-O as well as talk about some new work, such as the progress on the new container monitor conmon-rs, rewritten completely in Rust. The team will also talk about the integration with sigstore to secure CRI-O’s supply chain as well as some of the interesting work being done in CRI-O to stay in-line with upstream Kubernetes. These include the stats collection rework as well as the work to support evented PLEG. Audience members will leave with an understanding of what CRI-O is, and where it is going.",
      "attachment": null,
      "video": "https://www.youtube.com/watch?v=LtV6NSNIp0I"
    },
    {
      "name": "NRI: Extending Containerd And CRI-O With Common Plugins - Krisztian Litkey, Intel \u0026 Mike Brown, IBM",
      "url": "https://kccncna2022.sched.com/event/182JT/nri-extending-containerd-and-cri-o-with-common-plugins-krisztian-litkey-intel-mike-brown-ibm?iframe=no",
      "description": "The Node Resource Interface (NRI) was started as a subproject of containerd to provide OCI hook-like extensions as plugins which can perform extra actions outside the scope of CRI. This idea has since evolved into providing a common infrastructure for plugging extensions into CRI runtimes. Our proposed revision, which hopefully gets merged by the time of this presentation, turns NRI into a common runtime agnostic extension interface for plugging custom container adjustment logic into runtimes. It defines NRI using a formal protobuf protocol description and implements it as a set of ttRPC services. This improves the efficiency of plugin-runtime communication and enables straightforward implementation of stateful plugins. Our additions also expand the original scope of NRI, by allowing plugins to hook into virtually any of the pod and container life-cycle events and adjust a carefully chosen subset of container parameters. Integration to both containerd and CRI-O is available as experimental features. In this talk we'll take a closer look at how NRI and the plugins fit into runtimes, then cover some common and novel use cases, and example plugins for OCI hook injection and custom resource assignment.",
      "attachment": [
        {
          "name": "KubeCon NA 2022 NRI presentation",
          "type": "slides",
          "url": "https://static.sched.com/hosted_files/kccncna2022/cc/KubeCon-NA-2022-NRI-presentation.pdf"
        }
      ],
      "video": "https://www.youtube.com/watch?v=BOaW99BFbdA"
    },
    {
      "name": "Cloud-Native WebAssembly: Containerization On the Edge - Michael Yuan, Second State",
      "url": "https://kccncna2022.sched.com/event/182Ed/cloud-native-webassembly-containerization-on-the-edge-michael-yuan-second-state?iframe=no",
      "description": "The Linux container is a critical innovation that drives cloud-native applications. Developers are now deploying containerized applications outside of cloud centers on edge networks (e.g., serverless functions on CDNs), on edge devices (e.g., smart cars), and on SaaS (including databases) as embedded functions. In those use cases, the Linux container, with guest OS and support software, is too heavy, too slow, and not portable enough. WebAssembly (WASM) has emerged as a lightweight runtime for those applications. The WasmEdge Runtime and crun projects work together to make WASM a first-class citizen in the container ecosystem, running side by side with Linux containers in a single cluster, managed by existing container tools. In this talk, Michael will discuss how WASM fits into the container ecosystem, how to use container tools (e.g., CRI-O and containerd) to start WASM images, and how edge-optimized Kubernetes (e.g., KubeEdge / SuperEdge / OpenYurt) manage WASM applications.",
      "attachment": [
        {
          "name": "Cloud native WebAssembly.pptx",
          "type": "slides",
          "url": "https://static.sched.com/hosted_files/kccncna2022/27/Cloud%20native%20WebAssembly.pptx.pdf"
        }
      ],
      "video": "https://www.youtube.com/watch?v=Kg5z5A5wH0A"
    }
  ]
}
