{
  "url": "https://kccncna2024.sched.com/?searchstring=CRI-O\u0026iframe=no",
  "name": "KubeCon + CloudNativeCon North America 2024: Schedule",
  "sessions": [
    {
      "name": "CRI-O: First Class AI Model Teleportation - OCI Volume Mounts in CRI-O and Kubernetes | Project Lightning Talk",
      "url": "https://kccncna2024.sched.com/event/1iWAI/cri-o-first-class-ai-model-teleportation-oci-volume-mounts-in-cri-o-and-kubernetes-project-lightning-talk?iframe=no",
      "description": "Along with the Kubernetes community's corraling behind the usescases of generative AI comes a slew of implementation hurdles to overcome. One such hurdle is the problem of moving around bulky models. While many methods exist today, the SIG-Node and WG-Serving community sought to find a Kubernetes native approach. What better way than utilizing a foundational part of Kubernetes: the OCI distribution spec.In this talk, we will discuss the process of designing KEP-4639, the status of the feature, and go through some real world use-cases for using OCI distribution methods we know, love and rely-upon to move AI models to your production servers.",
      "attachment": null,
      "video": ""
    },
    {
      "name": "CRI-O Features for Fun and Profit - Peter Hunt \u0026 Sohan Kunkerkar, Red Hat",
      "url": "https://kccncna2024.sched.com/event/1hoy9/cri-o-features-for-fun-and-profit-peter-hunt-sohan-kunkerkar-red-hat?iframe=no",
      "description": "Are you a cluster admin looking to be on the cutting edge of Kubernetes features? How about an end-user looking to take full advantage of the capabilities of your cluster? This is the talk for you! Join Sohan Kunkerkar and Peter Hunt as they explore recent features in CRI-O and Kubernetes. They'll cover topics such as native sigstore signature support, running Podman in a Kubernetes pod, using OCI artifacts as a volume, and more. In each, they will highlight potential use cases, pitfalls and common patterns, as well as show how to use each in your cluster. If you're interested in the newest at the intersection of Kubernetes and container runtimes, step right up and learn away!",
      "attachment": null,
      "video": ""
    }
  ]
}
