{
  "url": "https://kccncna2023.sched.com/?searchstring=CRI-O\u0026iframe=no",
  "name": "KubeCon + CloudNative North America 2023: Schedule",
  "sessions": [
    {
      "name": "Graduated Project Celebration 🎉",
      "url": "https://kccncna2023.sched.com/event/1UTzL/graduated-project-celebration?iframe=no",
      "description": "Join us near the project pavilion for cupcakes to celebrate our newest Graduated Projects: Cilium, CRI-O, Istio, and KEDA!",
      "attachment": null,
      "video": ""
    },
    {
      "name": "Pods and Circumstance: CRI-O’s Graduation Celebration - Sascha Grunert \u0026 Peter Hunt, Red Hat",
      "url": "https://kccncna2023.sched.com/event/1R2vO/pods-and-circumstance-cri-os-graduation-celebration-sascha-grunert-peter-hunt-red-hat?iframe=no",
      "description": "CRI-O recently graduated within the CNCF ecosystem! That’s not only a huge milestone for the users of the project, but also for its maintainers. Having a stable and pluggable container runtime alternative available for Kubernetes provides end users more freedom of choice, generally drives innovation and avoids ending-up in silo projects which own all the knowledge of a technical domain. Join this session to learn more about the CNCF’s newest graduated container runtime! We discuss how the latest architecture looks, what the graduation process looked like for us, and how recent enhancements like verifying sigstore signatures work under the hood. The CRI-O maintainers will take you through a tour of recent features and usability improvements to shape the big picture of what they plan for the future of the project.",
      "attachment": [
        {
          "name": "KubeCon NA 2023   Pods and Circumstance CRI O’s Graduation Celebration",
          "type": "slides",
          "url": "https://static.sched.com/hosted_files/kccncna2023/5c/KubeCon%20NA%202023%20-%20Pods%20and%20Circumstance%20CRI-O%E2%80%99s%20Graduation%20Celebration.pdf"
        }
      ],
      "video": "https://www.youtube.com/watch?v=7MK_Mt7cbrY"
    }
  ]
}
