{
  "url": "https://kccnceu2022.sched.com/?searchstring=CRI-O\u0026iframe=no",
  "name": "KubeCon + CloudNativeCon Europe 2022: Schedule",
  "sessions": [
    {
      "name": "CRI-O: Secure, Performant, and Boring as Ever! - Peter Hunt, Urvashi Mohnani, Mrunal Patel \u0026 Sascha Grunert, Red Hat",
      "url": "https://kccnceu2022.sched.com/event/ytuh/cri-o-secure-performant-and-boring-as-ever-peter-hunt-urvashi-mohnani-mrunal-patel-sascha-grunert-red-hat?iframe=no",
      "description": "Anyone who has followed CRI-O, the OCI compliant implementation of the Kubernetes Container Runtime Interface (CRI), knows that it aims to be secure, performant, and over-all boring. Implemented as exactly the CRI implementation Kubernetes needs, and nothing more, allows it to be optimized, secured, and version-locked for Kubernetes. In this talk, Sascha Grunert, Mrunal Patel, Urvashi Mohnani, and Peter Hunt will give an overview of CRI-O, as well as discuss some recent improvements that highlight these three key aspects of CRI-O. The talk will cover the ease with which it transitioned between CRI versions, optimizations in container exec probes with conmon-rs, security improvements regarding SELinux relabelling for container volumes, and general security enhancements by running seccomp by default. People who join us, whether seasoned end-users or budding community members, should learn what CRI-O has to offer as the container manager that loves Kubernetes the most.Click here to view captioning/translation in the MeetingPlay platform!",
      "attachment": [
        {
          "name": "kubecon eu 2022 crio",
          "type": "slides",
          "url": "https://static.sched.com/hosted_files/kccnceu2022/e0/kubecon-eu-2022-crio.pdf"
        }
      ],
      "video": "https://www.youtube.com/watch?v=9OTsR3XN9Nk"
    },
    {
      "name": "Virtual Project Office Hours: CRI-O",
      "url": "https://kccnceu2022.sched.com/event/zL7P/virtual-project-office-hours-cri-o?iframe=no",
      "description": "Project Office Hours is an opportunity for KubeCon + CloudNativeCon attendees to meet the maintainers of the projects, learn more about the project, ask questions, learn about new features and upcoming updates. Below you'll find a list of upcoming Project Office Hours for Graduated, Incubating, and Sandbox projects with the date the office hour will be hosted. Click on the 'View Details' button for the project office hour in order to view additional information. Login is required to RSVP for the event. Once you register for an office hour, you will receive a confirmation email after you RSVP with the event details and how to join the project office hours.RSVP for CRI-O Project Office Hours here: ​https://community.cncf.io/e/mrjb4t/​​​\u003e\u003e Full list of Project Office Hours",
      "attachment": null,
      "video": ""
    }
  ]
}
