{
  "url": "https://kccnceu2021.sched.com/?searchstring=CRI-O\u0026iframe=no",
  "name": "KubeCon + CloudNativeCon Europe 2021 Virtual: Schedule",
  "sessions": [
    {
      "name": "Bug Bash Europe 2021 (Complimentary Registration Required)",
      "url": "https://kccnceu2021.sched.com/event/j9NY/bug-bash-europe-2021-complimentary-registration-required?iframe=no",
      "description": "The CNCF Bug Bash is a five-day competition where developers from around the world compete to smash as many bugs as they can on selected CNCF Projects. Compete as individuals and as a team for prizes, glory, and honor.You'll compete with other developers to smash as many bugs as possible on the following CNCF Projects, most of which are written in Go.ThanosServerless WorkflowChaos MeshCRI-OTinkerbellOpenEBSBuildPackschemaheroThe Bash is open to developers of all levels. If you're a newer developer who wants to learn from a senior developer, or a senior developer interested in working with a junior developer, make a note when you sign up!How to Register: Complimentary pre-registration is required to participate in Bug Bash Europe 2021. Register here!Have some questions? Reach out to vwells@sonatype.com.",
      "attachment": null,
      "video": ""
    },
    {
      "name": "Project Office Hours: CRI-O",
      "url": "https://kccnceu2021.sched.com/event/ijMN/project-office-hours-cri-o?iframe=no",
      "description": "Project Office Hours is an opportunity for KubeCon + CloudNativeCon attendees to meet the maintainers of the projects, learn more about the project, ask questions, learn about new features and upcoming updates. Below you'll find a list of upcoming Project Office Hours for Graduated, Incubating, and Sandbox projects with the date the office hour will be hosted. Click on the 'View Details' button for the project office hour in order to view additional information. Login is required to RSVP for the event. Once you register for an office hour, you will receive a confirmation email after you RSVP with the event details and how to join the project office hours.RSVP for CRI-O Office Hours here: https://community.cncf.io/e/m93asp/\u003e\u003eFull list of Project Office Hours",
      "attachment": null,
      "video": ""
    },
    {
      "name": "Project Office Hours: CRI-O",
      "url": "https://kccnceu2021.sched.com/event/ijPE/project-office-hours-cri-o?iframe=no",
      "description": "Project Office Hours is an opportunity for KubeCon + CloudNativeCon attendees to meet the maintainers of the projects, learn more about the project, ask questions, learn about new features and upcoming updates. Below you'll find a list of upcoming Project Office Hours for Graduated, Incubating, and Sandbox projects with the date the office hour will be hosted. Click on the 'View Details' button for the project office hour in order to view additional information. Login is required to RSVP for the event. Once you register for an office hour, you will receive a confirmation email after you RSVP with the event details and how to join the project office hours.RSVP for CRI-O Project Office Hours here: https://community.cncf.io/e/mnc2ff/\u003e\u003eFull list of Project Office Hours",
      "attachment": null,
      "video": ""
    },
    {
      "name": "CRI-O Still Loves Kubernetes - Sasha Grunert, Peter Hunt, Urvashi Mohnani \u0026 Mrunal Patel, Red Hat",
      "url": "https://kccnceu2021.sched.com/event/iE6L/cri-o-still-loves-kubernetes-sasha-grunert-peter-hunt-urvashi-mohnani-mrunal-patel-red-hat?iframe=no",
      "description": "In Kubernetes 1.20, support for the dockershim was deprecated, leaving many wondering what will take its place. Wonder no longer: CRI-O is a container runtime written exclusively for Kubernetes, and is ready to take the dockershim’s place. In addition to being a standard component for deploying secure and stable Kubernetes clusters, CRI-O has the unique advantage of being able to tailor its behavior to the needs of the Kubelet. In this talk, the maintainers of CRI-O will provide an update about the latest feature developments, as well as live demonstrating typical real world use cases around them. Join the CRI-O maintainers as they walk through the latest improvements in communication with the Kubelet under load, container stats reporting, user namespaces, and seccomp profile generation, as well as a general project update. After this session, you should know more about how CRI-O works in action and why it’s the perfect choice for your Kubernetes cluster!",
      "attachment": [
        {
          "name": "kubecon eu 2021 crio",
          "type": "slides",
          "url": "https://static.sched.com/hosted_files/kccnceu2021/71/kubecon-eu-2021-crio.pdf"
        },
        {
          "name": "Plain Text Transcript 18 GKMZ 8730",
          "type": "other",
          "url": "https://static.sched.com/hosted_files/kccnceu2021/a9/Plain_Text_Transcript_18_GKMZ-8730"
        }
      ],
      "video": "http://www.youtube.com/watch?v=iWTYTwsbxL4"
    },
    {
      "name": "Maximizing Workload's Performance With Smarter Runtimes - Krisztian Litkey \u0026 Alexander Kanevskiy, Intel",
      "url": "https://kccnceu2021.sched.com/event/iE1Y/maximizing-workloads-performance-with-smarter-runtimes-krisztian-litkey-alexander-kanevskiy-intel?iframe=no",
      "description": "Mitigating noisy neighbours in the world of containers is not an easy task. There are several solutions exists and many of those have own limitations. This presentation will be focusing on exploring new ways of innovations for container runtimes that helps get maximum performance and resource utilisation without modifications of the workloads. In this talk we are planning to briefly cover existing extension points for containerd and CRI-O, talk about new ideas from NRI proposal, as well as covering evolution of dynamic resource usage optimisations in our project CRI-Resource-Manager. We want to share our experience on dealing with heterogenous CPU resources, multi-tiered Memory, Caches, Memory Bandwidth and Block I/O usage. We want to demonstrate how using various metrics and hints provided by Linux kernel can lead to improvements of workload performance and dynamic hardware resource utilisation optimisations.",
      "attachment": [
        {
          "name": "Maximizing workloads performance with smarter runtimes   v1",
          "type": "slides",
          "url": "https://static.sched.com/hosted_files/kccnceu2021/e4/Maximizing%20workloads%20performance%20with%20smarter%20runtimes%20-%20v1.pdf"
        },
        {
          "name": "Plain Text Transcript 27 SVZM 9546",
          "type": "other",
          "url": "https://static.sched.com/hosted_files/kccnceu2021/1f/Plain_Text_Transcript_27_SVZM-9546"
        },
        {
          "name": "Plain Text Transcript 27 SVZM 9546",
          "type": "other",
          "url": "https://static.sched.com/hosted_files/kccnceu2021/76/Plain_Text_Transcript_27_SVZM-9546"
        }
      ],
      "video": "http://www.youtube.com/watch?v=BwQmjunIsFI"
    }
  ]
}
