{
  "url": "https://kccnceu2024.sched.com/?searchstring=CRI-O\u0026iframe=no",
  "name": "KubeCon + CloudNativeCon Europe 2024: Schedule",
  "sessions": [
    {
      "name": "Project Pavilion - AM Kiosks",
      "url": "https://kccnceu2024.sched.com/event/1b5y2/project-pavilion-am-kiosks?iframe=no",
      "description": "Welcome to the Project Pavilion! Below, you'll find a lineup of projects scheduled for Wednesday morning. Please be aware that kiosk assignments may change daily. We encourage you to refer to the Project Kiosk Directory and Project Pavilion floor plan regularly for updates on upcoming projects hosted in the Pavilion.PP1-A (Wed)PP11-B (Thurs) OpenFGAPP1-B KubeflowPP2-A LitmusChaosPP2-B KnativePP3-A KanisterPP3-B FalcoPP4-A KubescapePP4-B CopaPP5-A ArgoPP5-B CiliumPP6-A EnvoyPP6-B Fluentd \u0026 Fluent BitPP7-A CortexPP7-B KeptnPP8-A KyvernoPP8-B KubeEdgePP9-A FluxPP9-B IstioPP10-A TUF and in-totoPP10-B Cloud CustodianPP11-A LinkerdPP11-B Deaf \u0026 Hard of Hearing WG (TAG CS)PP12-A CRI-OPP12-B HelmPP13-A PrometheusPP13-B JaegerPP14-A etcdPP14-B Open Policy AgentPP15-A RookPP15-B containerdPP16-A WasmEdgePP16-B LonghornPP17-A Operator FrameworkPP17-B Headlamp + Inspektor GadgetPP18-A ThanosPP19-A TAG App DeliveryPP19-B KubesprayPP20-A Community-Hosted EventsPP20-B TAG Environmental Sustainability",
      "attachment": null,
      "video": ""
    },
    {
      "name": "Project Pavilion - AM Kiosks",
      "url": "https://kccnceu2024.sched.com/event/1b5yw/project-pavilion-am-kiosks?iframe=no",
      "description": "Welcome to the Project Pavilion! Below, you'll find a lineup of projects scheduled for Thursday morning. Please be aware that kiosk assignments may change daily. We encourage you to refer to the Project Kiosk Directory and Project Pavilion floor plan regularly for updates on upcoming projects hosted in the Pavilion.PP1-A CapsulePP1-B KubeflowPP2-A LitmusChaosPP2-B KnativePP3-A TinkerbellPP3-B FalcoPP4-A KumaPP4-B CarvelPP5-A ArgoPP5-B CiliumPP6-A EnvoyPP6-B Fluentd \u0026 Fluent BitPP7-A CortexPP7-B KeptnPP8-A KyvernoPP8-A Metal3PP8-B KubeEdgePP9-A FluxPP9-B IstioPP10-A TUF and in-totoPP10-B Cloud CustodianPP11-A LinkerdPP11-B Deaf \u0026 Hard of Hearing WG (TAG CS)PP12-A CRI-OPP12-B HelmPP13-A PrometheusPP13-B JaegerPP14-A etcdPP14-B Open Policy AgentPP15-A RookPP15-B containerdPP16-B LonghornPP17-A Operator FrameworkPP17-B werfPP18-A ThanosPP19-A TAG App DeliveryPP19-B KubesprayPP20-A Community-Hosted EventsPP20-B TAG Environmental Sustainability",
      "attachment": null,
      "video": ""
    },
    {
      "name": "CRI-O Odyssey: Exploring New Frontiers in Container Runtimes - Julien Ropé \u0026 Sohan Kunkerkar, Red Hat",
      "url": "https://kccnceu2024.sched.com/event/1Yhgj/cri-o-odyssey-exploring-new-frontiers-in-container-runtimes-julien-rope-sohan-kunkerkar-red-hat?iframe=no",
      "description": "No journey is ever really done, it only continues differently. CRI-O's journey in continuing its effort to be the best container runtime made specifically for Kubernetes is no different, even after graduating within the CNCF. In this talk, join the CRI-O developers as they walk you through the new frontiers of container runtimes: such as integration with WebAssembly (WASM), secured and simplified Podman-in-Kubernetes, and the present and future of Confidential Computing. This session will also cover initiatives CRI-O is following within SIG-Node, such as CRI stats and separate image file systems.This session caters to both newcomers and seasoned users, offering insights into CRI-O's new features and journey beyond.",
      "attachment": [
        {
          "name": "CRI O Presentation",
          "type": "slides",
          "url": "https://static.sched.com/hosted_files/kccnceu2024/ea/CRI-O%20Presentation.pdf"
        }
      ],
      "video": "https://www.youtube.com/watch?v=mDPLioNIIjo"
    },
    {
      "name": "Project Pavilion - AM Kiosks",
      "url": "https://kccnceu2024.sched.com/event/1b5z3/project-pavilion-am-kiosks?iframe=no",
      "description": "Welcome to the Project Pavilion! Below, you'll find a lineup of projects scheduled for Friday morning. Please be aware that kiosk assignments may change daily. We encourage you to refer to the Project Kiosk Directory and Project Pavilion floor plan regularly for updates on upcoming projects hosted in the Pavilion.PP1-A Logging OperatorPP1-B KubeflowPP2-A LitmusChaosPP2-B KnativePP3-A KonveyorPP3-B FalcoPP4-A K8upPP4-B ArmadaPP5-A ArgoPP5-B CiliumPP6-A EnvoyPP6-B Fluentd \u0026 Fluent BitPP7-A CortexPP7-B KeptnPP8-A KyvernoPP8-B KubeEdgePP9-A FluxPP9-B IstioPP10-A TUF and in-totoPP10-B Cloud CustodianPP11-A LinkerdPP11-B Deaf \u0026 Hard of Hearing WG (TAG CS)PP12-A CRI-OPP12-B HelmPP13-A PrometheusPP13-B JaegerPP14-A etcdPP14-B Open Policy AgentPP15-A RookPP15-B containerdPP16-A PipeCDPP16-B LonghornPP17-A Operator FrameworkPP17-B KeplerPP18-A ThanosPP19-A TAG App DeliveryPP19-B KubesprayPP20-A Community-Hosted EventsPP20-B TAG Environmental Sustainability",
      "attachment": null,
      "video": ""
    }
  ]
}
