{
  "url": "https://kccnceu2023.sched.com/?searchstring=CRI-O\u0026iframe=no",
  "name": "KubeCon + CloudNativeCon Europe 2023: Schedule",
  "sessions": [
    {
      "name": "Secure Your Project with the SIG Release Supply Chain Kit - Adolfo García Veytia \u0026 Carlos Panato, Chainguard",
      "url": "https://kccnceu2023.sched.com/event/1Hydq/secure-your-project-with-the-sig-release-supply-chain-kit-adolfo-garcia-veytia-carlos-panato-chainguard?iframe=no",
      "description": "Over the past two years, Kubernetes SIG Release shifted focus from automating the k8s release process to building stronger security features. And now, all the work done by the Release Engineering team has been packaged into really cool tools that anybody can use to harden their project's supply chain security stance. Our toolkit lets users pick and choose from the same components that our Release Managers use to secure the Kubernetes releases with features like: * Software Bill of Materials * Signed SLSA provenance attestations * Signed container images and artifacts * Secure GitHub release pages The tools can work with any project, no need to be part of the Kubernetes family! In this talk, puerco will showcase how these tools are in use today, helping secure the releases of other projects across the Cloud Native landscape, including Knative, Istio, Cilium, CRI-O, Vitess, and others. He will show simple examples to achieve better supply chain security in your project by signing artifacts, creating SBOMs, and provenance data just as big OSS projects do it. All using helpful reusable GitHub actions. The talk will close with a shameless call for contributors passionate about CI/CD and software supply chain security to come and join the Kubernetes Release Engineering team!",
      "attachment": null,
      "video": "https://www.youtube.com/watch?v=AwzrMnxQ6c4"
    },
    {
      "name": "CRI-O's Back, Alright! - Peter Hunt \u0026 Urvashi Mohnani, Red Hat",
      "url": "https://kccnceu2023.sched.com/event/1HyUV/cri-os-back-alright-peter-hunt-urvashi-mohnani-red-hat?iframe=no",
      "description": "The CNCF landscape is full of options and admins often have trouble choosing projects for different parts of the stack. In the world of Container Runtime Interface (CRI) implementations, CRI-O is an excellent option, mixing a combination of new features with dependable stability. In this talk, join us while we walk through what CRI-O is, what it does, and how to install it, as well as some fun new features that've been added recently: like FreeBSD support, NRI support, and seccomp notify support. Audience members joining this session will learn many of the benefits CRI-O has to offer!",
      "attachment": null,
      "video": "https://www.youtube.com/watch?v=Cvz55tP9xVQ"
    },
    {
      "name": "A Look Under the Hood of CNCF Security Audits - Adam Korczynski \u0026 David Korczynski, Ada Logics",
      "url": "https://kccnceu2023.sched.com/event/1Hybf/a-look-under-the-hood-of-cncf-security-audits-adam-korczynski-david-korczynski-ada-logics?iframe=no",
      "description": "To graduate, a CNCF project must complete a third party security audit and publish the results publicly. Because of the nature of the work, much of it is done behind closed doors. In this talk, Adam and David present their experiences with auditing CNCF projects, how a security audit progresses, what the projects should expect, and what the outcomes have been so far. We also examine which vulnerabilities have been found, and what is required from the CNCF projects to complete a third party security audit. Over the last year and a half, Ada Logics has carried out security audits of six CNCF projects and worked with the projects on mitigating found issues and publishing the results. The projects the team audited were: Flux, CRI-O, KubeEdge, Argo, Istio and Cilium. The talk will also go over the audit reports and how they are helpful to contributors, adopters and other security researchers looking to contribute security work. The talk will cover both high-level problems and results as well as a technical look into the security issues that CNCF projects face.",
      "attachment": null,
      "video": "https://www.youtube.com/watch?v=YGN0Z9SOVBE"
    }
  ]
}
