{
  "url": "https://kccncna2021.sched.com/?searchstring=CRI-O\u0026iframe=no",
  "name": "KubeCon + CloudNative North America 2021: Schedule",
  "sessions": [
    {
      "name": "Virtual Project Office Hours: CRI-O",
      "url": "https://kccncna2021.sched.com/event/n0Ch/virtual-project-office-hours-cri-o?iframe=no",
      "description": "Project Office Hours is an opportunity for KubeCon + CloudNativeCon attendees to meet the maintainers of the projects, learn more about the project, ask questions, learn about new features and upcoming updates. Below you'll find a list of upcoming Project Office Hours for Graduated, Incubating, and Sandbox projects with the date the office hour will be hosted. Click on the 'View Details' button for the project office hour in order to view additional information. Login is required to RSVP for the event. Once you register for an office hour, you will receive a confirmation email after you RSVP with the event details and how to join the project office hours.RSVP for CRI-O Project Office Hours here: https://community.cncf.io/e/m42pns/\u003e\u003e Full list of Project Office Hours",
      "attachment": null,
      "video": ""
    },
    {
      "name": "What's New in CRI-O? - Mrunal Patel, Urvashi Mohnani, Sascha Grunert \u0026 Peter Hunt, Red Hat",
      "url": "https://kccncna2021.sched.com/event/lV7f/whats-new-in-cri-o-mrunal-patel-urvashi-mohnani-sascha-grunert-peter-hunt-red-hat?iframe=no",
      "description": "CRI-O is a lightweight container runtime written exclusively for Kubernetes. In addition to being a standard component for deploying secure and stable Kubernetes clusters, CRI-O has the unique advantage of being able to tailor its behavior to the needs of the Kubernetes ecosystem. In this talk, Mrunal Patel, Urvashi Mohnani, Sascha Grunert and Peter Hunt, the maintainers of CRI-O, will provide an update about the latest feature developments, as well as live demonstrating typical real world use cases around them. In addition to a review of the basics of setting up and using CRI-O with Kubernetes, the talk will cover improvements around the handling of CNI resources, the ability to tailor container resources with workload types, and updates to the collection and broadcasting of stats and metrics. Join the CRI-O maintainers to learn more about how CRI-O works in action and why it’s the perfect choice for your Kubernetes cluster!",
      "attachment": null,
      "video": ""
    },
    {
      "name": "Faster Container Image Distribution on a Variety of Tools with Lazy Pulling - Kohei Tokunaga, NTT Corporation \u0026 Tao Peng, Ant Financial",
      "url": "https://kccncna2021.sched.com/event/lV2a/faster-container-image-distribution-on-a-variety-of-tools-with-lazy-pulling-kohei-tokunaga-ntt-corporation-tao-peng-ant-financial?iframe=no",
      "description": "Pull is known as one of the time-consuming steps in the container lifecycle. One of the root causes is the current OCI Image Specification because it can't run containers before the entire image contents become locally available. In this session, Kohei and Tao introduce state-of-the-art OCI-alternative image formats discussed in the community for speeding up pulling images, especially putting the focus on eStargz and nydus. These formats enable \"lazy pulling\" that allows container runtime to startup a container without waiting for the entire image. Over the past year, lazy pulling has been available on more and more container-related tools including Kubernetes, containerd, CRI-O, Podman, BuildKit, etc. So they will show how widely these image formats can be used on these tools in daily activity. eStargz has been proposed to OCI Image Specification as an extension and nydus has so to the next version of that spec (a.k.a. OCIv2). The talk will also share the discussion status.",
      "attachment": [
        {
          "name": "slides",
          "type": "slides",
          "url": "https://static.sched.com/hosted_files/kccncna2021/1f/slides.pdf"
        }
      ],
      "video": ""
    },
    {
      "name": "Do Not Disturb Mode: Fine-Tuning Resources for Latency Sensitive Workloads - Antti Kervinen, Intel \u0026 Peter Hunt, Red Hat",
      "url": "https://kccncna2021.sched.com/event/m4t2/do-not-disturb-mode-fine-tuning-resources-for-latency-sensitive-workloads-antti-kervinen-intel-peter-hunt-red-hat?iframe=no",
      "description": "Do you get your best work done without interruptions? Many people do, and Kubernetes workloads are no different. While there exist ways to run workloads in Kubernetes on dedicated CPUs, they still share resources like CPU cache, memory bandwidth and storage I/O. Recently, CRI-O and containerd have been extended to allow admins to control how these resources are shared. With the correct hardware and node configuration, users can put their applications in different classes that configure the amount of storage and memory bandwidth, and CPU cache that their applications need.In this talk, Antti Kervinen and Peter Hunt will talk about required hardware, the extensions, and describe ways that admins can configure their workloads to finally get some peace and quiet.",
      "attachment": [
        {
          "name": "DoNotDisturbMode KervinenHunt",
          "type": "slides",
          "url": "https://static.sched.com/hosted_files/kccncna2021/89/DoNotDisturbMode_KervinenHunt.pdf"
        }
      ],
      "video": ""
    }
  ]
}
